       IDENTIFICATION DIVISION.
       PROGRAM-ID.    EX01.
       AUTHOR.        LUCAS SILVA.
       DATE-WRITTEN.  2025-08-03.
       DATE-COMPILED.
      *REMARKS.      ESSE PROGRAMA GRAVA UMA COPIA DOS REGISTROS DE 
      *              CADCLI1 EM CADCLI2.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES. DECIMAL-POINT IS COMMA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CADCLI1 ASSIGN TO DISK
           ORGANIZATION IS LINE SEQUENTIAL.
           SELECT CADCLI2 ASSIGN TO DISK
           ORGANIZATION IS LINE SEQUENTIAL.
           
