       IDENTIFICATION DIVISION.
       PROGRAM-ID.   EX03.
       AUTHOR.       LUCAS SILVA.
       DATE-WRITTEN. 2025-09-08.
       DATE-COMPILED.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES. DECIMAL-POINT IS COMMA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CADLU ASSIGN TO DISK
           ORGANIZATION IS LINE SEQUENTIAL.
           SELECT CADTU ASSIGN TO DISK
           ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.

       FD CADLU 
           LABEL RECORD ARE STANDARD
           VALUE OF FILE-ID IS "CADLU.TXT".

       01 REG-CADLU.
           02 NUM-ENT  PIC 9(05).
           02 NOME-ENT PIC X(20).
           02 NOTA1    PIC 9(2)V99.
           02 NOTA2    PIC 9(2)V99.
           02 NOTA3    PIC 9(2)V99.

       FD CADTU
           LABEL RECORD ARE STANDARD
           VALUE OF FILE-ID IS "CADTU.TXT".

       01 REG-CADTU.
           02 NUM-SAI  PIC 9(05).
           02 MEDIA    PIC 9(2)V99.

       WORKING-STORAGE SECTION.
       77 FIM-ARQ   PIC X(03)   VALUE "NAO".
       77 SOMA-NOTA PIC 9(2)V99 VALUE ZEROS.
       77 WMEDIA    PIC 9(2)V99 VALUE ZEROS.

       PROCEDURE DIVISION.
           PERFORM INICIO
           PERFORM PRINCIPAL UNTIL FIM-ARQ = "SIM"
           PERFORM TERMINO
           STOP RUN.

       INICIO.
           OPEN INPUT CADLU OUTPUT CADTU.
           PERFORM LEITURA.

       TERMINO.
           CLOSE CADLU.
           CLOSE CADTU.

       LEITURA.
           READ CADLU AT END
               MOVE "SIM" TO FIM-ARQ.

       PRINCIPAL.
           PERFORM CALCULA-MEDIA.
           PERFORM GRAVACAO.
           PERFORM LEITURA.

       GRAVACAO.
           MOVE NUM-ENT TO NUM-SAI
           MOVE WMEDIA TO MEDIA.
           WRITE REG-CADTU.


       CALCULA-MEDIA.
           ADD NOTA1 NOTA2 NOTA3 GIVING SOMA-NOTA.
           DIVIDE SOMA-NOTA BY 3 GIVING WMEDIA.
           