       IDENTIFICATION DIVISION.
       PROGRAM-ID.   EX02.
       AUTHOR.       LUCAS SILVA.
       DATE-WRITTEN. 2025-08-07.
       DATE-COMPILED.
      *REMARKS       ESSE PROGRAMA LEVA OS REGISTROS DE CADLU PARA CADTU
      *              MAS SEM O CAMPO "SEXO",

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES. DECIMAL-POINT IS COMMA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CADLU ASSIGN TO DISK
           ORGANIZATION IS LINE SEQUENTIAL.
           SELECT CADTU ASSIGN TO DISK
           ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.

       FD CADLU 
           LABEL RECORD ARE STANDARD
           VALUE OF FILE-ID IS "CADLU.TXT".

       01 REG-CADLU.
           02 NUM-ENT  PIC 9(05).
           02 NOME-ENT PIC X(20).
           02 SEX-ENT  PIC X(01).
           02 DATA-ENT PIC 9(08).

       FD CADTU
           LABEL RECORD ARE STANDARD
           VALUE OF FILE-ID IS "CADTU.TXT".

       01 REG-CADTU.
           02 NUM-SAI  PIC 9(05).
           02 NOME-SAI PIC X(20).
           02 DATA-SAI PIC 9(08).

       WORKING-STORAGE SECTION.
       77 FIM-ARQ PIC X(03) VALUE "NAO".

       PROCEDURE DIVISION.
           PERFORM INICIO
           PERFORM PRINCIPAL UNTIL FIM-ARQ = "SIM"
           PERFORM TERMINO
           STOP RUN.

       INICIO.
           OPEN INPUT CADLU OUTPUT CADTU.
           PERFORM LEITURA.

       LEITURA.
           READ CADLU AT END
               MOVE "SIM" TO FIM-ARQ.

       PRINCIPAL.
           PERFORM GRAVACAO.
           PERFORM LEITURA.

       GRAVACAO.
           MOVE NUM-ENT TO NUM-SAI.
           MOVE NOME-ENT TO NOME-SAI.
           MOVE DATA-ENT TO DATA-SAI.
           WRITE REG-CADTU.

       TERMINO.
           CLOSE CADLU CADTU.

